<table>
<tr>
<td width=15%><img src="https://www.nitrkl.ac.in/assets/images/logo.png"></img></td>
<td><center><h1>National Institute of Technology
Rourkela, Odisha, India, 769008</h1><h2>Department of Computer Science Engineering</h2></center></td>
</tr>
<tr><td colspan=2><center><h3>Lab-2: Computer Vision Lab</h3></center></br>
<center><h3>Amiya Chowdhury Roll: 122CS0067</h3></center>
            <center><b>(Assignment-5)</b></center></td></tr>
</table>

______
**1. Write a program to initialize a dictionary (of your choice) and create a pandas DataFrame from it. Print the dataframe?**

In [1]:
#Code here
import pandas as pd
dict1={'Movies':["Interstellar","Pulp Fiction","Pather Panchali"],"Director":['Nolan','Tarantino','Satyajit']}

df=pd.DataFrame(dict1)

df

            Movies   Director
0     Interstellar      Nolan
1     Pulp Fiction  Tarantino
2  Pather Panchali   Satyajit

___
**2. Write a program to read the CSV file "summer.csv" into a pandas DataFrame "df", display the first 5 rows, and print the DataFrame's shape**

In [2]:
#Code here
fr=pd.read_csv("summer.csv")
print(fr.head(5))
print(fr.shape)

   Year    City     Sport Discipline             Athlete Country Gender  \
0  1896  Athens  Aquatics   Swimming       HAJOS, Alfred     HUN    Men
1  1896  Athens  Aquatics   Swimming    HERSCHMANN, Otto     AUT    Men
2  1896  Athens  Aquatics   Swimming   DRIVAS, Dimitrios     GRE    Men
3  1896  Athens  Aquatics   Swimming  MALOKINIS, Ioannis     GRE    Men
4  1896  Athens  Aquatics   Swimming  CHASAPIS, Spiridon     GRE    Men

                        Event   Medal
0              100M Freestyle    Gold
1              100M Freestyle  Silver
2  100M Freestyle For Sailors  Bronze
3  100M Freestyle For Sailors    Gold
4  100M Freestyle For Sailors  Silver
(31165, 9)

___
**3. Write a program to display the last 10 rows of the DataFrame?**

In [3]:
#Code here
print(fr.tail(10))

       Year    City      Sport           Discipline  \
31155  2012  London  Wrestling  Wrestling Freestyle
31156  2012  London  Wrestling  Wrestling Freestyle
31157  2012  London  Wrestling  Wrestling Freestyle
31158  2012  London  Wrestling  Wrestling Freestyle
31159  2012  London  Wrestling  Wrestling Freestyle
31160  2012  London  Wrestling  Wrestling Freestyle
31161  2012  London  Wrestling  Wrestling Freestyle
31162  2012  London  Wrestling  Wrestling Freestyle
31163  2012  London  Wrestling  Wrestling Freestyle
31164  2012  London  Wrestling  Wrestling Freestyle

                            Athlete Country Gender     Event   Medal
31155                 AHMADOV, Emin     AZE    Men  Wg 74 KG  Bronze
31156          KAZAKEVIC, Aleksandr     LTU    Men  Wg 74 KG  Bronze
31157                 KHUGAEV, Alan     RUS    Men  Wg 84 KG    Gold
31158  EBRAHIM, Karam Mohamed Gaber     EGY    Men  Wg 84 KG  Silver
31159               GAJIYEV, Danyal     KAZ    Men  Wg 84 KG  Bronze
31160            JANIKOWSKI, Damian     POL    Men  Wg 84 KG  Bronze
31161     REZAEI, Ghasem Gholamreza     IRI    Men  Wg 96 KG    Gold
31162                TOTROV, Rustam     RUS    Men  Wg 96 KG  Silver
31163             ALEKSANYAN, Artur     ARM    Men  Wg 96 KG  Bronze
31164                LIDBERG, Jimmy     SWE    Men  Wg 96 KG  Bronze

___
**4. Write a program to get a summary of the DataFrame (such as the mean, count, etc.) and print the data types of all columns?**

In [5]:
#Code here
print(fr.describe())
print(fr.dtypes)

               Year
count  31165.000000
mean    1970.482785
std       33.158416
min     1896.000000
25%     1948.000000
50%     1980.000000
75%     2000.000000
max     2012.000000
Year           int64
City          object
Sport         object
Discipline    object
Athlete       object
Country       object
Gender        object
Event         object
Medal         object
dtype: object

___
**5. Write a program to select a single column "Gender" from the DataFrame?**

In [6]:
#Code here
fr.Gender

0        Men
1        Men
2        Men
3        Men
4        Men
        ...
31160    Men
31161    Men
31162    Men
31163    Men
31164    Men
Name: Gender, Length: 31165, dtype: object

___
**6. Write a program to select multiple columns "Year" and "City" from the DataFrame?**

In [7]:
#Code here
fr[['Year','City']]

       Year    City
0      1896  Athens
1      1896  Athens
2      1896  Athens
3      1896  Athens
4      1896  Athens
...     ...     ...
31160  2012  London
31161  2012  London
31162  2012  London
31163  2012  London
31164  2012  London

[31165 rows x 2 columns]

___
**7. Write a program to  filter rows in a DataFrame based on the condition that Gender = Men ?**

In [11]:
#Code here
mask=fr.Gender=="Men"
print(fr[fr.Gender=="Men"])

       Year    City      Sport           Discipline  \
0      1896  Athens   Aquatics             Swimming
1      1896  Athens   Aquatics             Swimming
2      1896  Athens   Aquatics             Swimming
3      1896  Athens   Aquatics             Swimming
4      1896  Athens   Aquatics             Swimming
...     ...     ...        ...                  ...
31160  2012  London  Wrestling  Wrestling Freestyle
31161  2012  London  Wrestling  Wrestling Freestyle
31162  2012  London  Wrestling  Wrestling Freestyle
31163  2012  London  Wrestling  Wrestling Freestyle
31164  2012  London  Wrestling  Wrestling Freestyle

                         Athlete Country Gender                       Event  \
0                  HAJOS, Alfred     HUN    Men              100M Freestyle
1               HERSCHMANN, Otto     AUT    Men              100M Freestyle
2              DRIVAS, Dimitrios     GRE    Men  100M Freestyle For Sailors
3             MALOKINIS, Ioannis     GRE    Men  100M Freestyle For Sailors
4             CHASAPIS, Spiridon     GRE    Men  100M Freestyle For Sailors
...                          ...     ...    ...                         ...
31160         JANIKOWSKI, Damian     POL    Men                    Wg 84 KG
31161  REZAEI, Ghasem Gholamreza     IRI    Men                    Wg 96 KG
31162             TOTROV, Rustam     RUS    Men                    Wg 96 KG
31163          ALEKSANYAN, Artur     ARM    Men                    Wg 96 KG
31164             LIDBERG, Jimmy     SWE    Men                    Wg 96 KG

        Medal
0        Gold
1      Silver
2      Bronze
3        Gold
4      Silver
...       ...
31160  Bronze
31161    Gold
31162  Silver
31163  Bronze
31164  Bronze

[22746 rows x 9 columns]

___
**8. Write a program to select and print the first 5 rows and columns 2 to 6 (inclusive) of the DataFrame. Also, print the type of the resulting object?**

In [18]:
#Code here

fr1=fr.iloc[:5,2:7]
print(fr1)
print('Type of Object=',type(fr1))

      Sport Discipline             Athlete Country Gender
0  Aquatics   Swimming       HAJOS, Alfred     HUN    Men
1  Aquatics   Swimming    HERSCHMANN, Otto     AUT    Men
2  Aquatics   Swimming   DRIVAS, Dimitrios     GRE    Men
3  Aquatics   Swimming  MALOKINIS, Ioannis     GRE    Men
4  Aquatics   Swimming  CHASAPIS, Spiridon     GRE    Men
Type of Object= <class 'pandas.core.frame.DataFrame'>

___
**9. Write a program to  delete a column "City" from the DataFrame and print the new dataframe??**

In [19]:
#Code here
fr2=fr.drop(columns='City')
print(fr2)

       Year      Sport           Discipline                    Athlete  \
0      1896   Aquatics             Swimming              HAJOS, Alfred
1      1896   Aquatics             Swimming           HERSCHMANN, Otto
2      1896   Aquatics             Swimming          DRIVAS, Dimitrios
3      1896   Aquatics             Swimming         MALOKINIS, Ioannis
4      1896   Aquatics             Swimming         CHASAPIS, Spiridon
...     ...        ...                  ...                        ...
31160  2012  Wrestling  Wrestling Freestyle         JANIKOWSKI, Damian
31161  2012  Wrestling  Wrestling Freestyle  REZAEI, Ghasem Gholamreza
31162  2012  Wrestling  Wrestling Freestyle             TOTROV, Rustam
31163  2012  Wrestling  Wrestling Freestyle          ALEKSANYAN, Artur
31164  2012  Wrestling  Wrestling Freestyle             LIDBERG, Jimmy

      Country Gender                       Event   Medal
0         HUN    Men              100M Freestyle    Gold
1         AUT    Men              100M Freestyle  Silver
2         GRE    Men  100M Freestyle For Sailors  Bronze
3         GRE    Men  100M Freestyle For Sailors    Gold
4         GRE    Men  100M Freestyle For Sailors  Silver
...       ...    ...                         ...     ...
31160     POL    Men                    Wg 84 KG  Bronze
31161     IRI    Men                    Wg 96 KG    Gold
31162     RUS    Men                    Wg 96 KG  Silver
31163     ARM    Men                    Wg 96 KG  Bronze
31164     SWE    Men                    Wg 96 KG  Bronze

[31165 rows x 8 columns]

___
**10. Write a program to  rename a column "Athlete" to "Participants" in the DataFrame?**

In [21]:
#Code here
fr2=fr.rename(columns={'Athlete':'Participants'})
print(fr2)

       Year    City      Sport           Discipline  \
0      1896  Athens   Aquatics             Swimming
1      1896  Athens   Aquatics             Swimming
2      1896  Athens   Aquatics             Swimming
3      1896  Athens   Aquatics             Swimming
4      1896  Athens   Aquatics             Swimming
...     ...     ...        ...                  ...
31160  2012  London  Wrestling  Wrestling Freestyle
31161  2012  London  Wrestling  Wrestling Freestyle
31162  2012  London  Wrestling  Wrestling Freestyle
31163  2012  London  Wrestling  Wrestling Freestyle
31164  2012  London  Wrestling  Wrestling Freestyle

                    Participants Country Gender                       Event  \
0                  HAJOS, Alfred     HUN    Men              100M Freestyle
1               HERSCHMANN, Otto     AUT    Men              100M Freestyle
2              DRIVAS, Dimitrios     GRE    Men  100M Freestyle For Sailors
3             MALOKINIS, Ioannis     GRE    Men  100M Freestyle For Sailors
4             CHASAPIS, Spiridon     GRE    Men  100M Freestyle For Sailors
...                          ...     ...    ...                         ...
31160         JANIKOWSKI, Damian     POL    Men                    Wg 84 KG
31161  REZAEI, Ghasem Gholamreza     IRI    Men                    Wg 96 KG
31162             TOTROV, Rustam     RUS    Men                    Wg 96 KG
31163          ALEKSANYAN, Artur     ARM    Men                    Wg 96 KG
31164             LIDBERG, Jimmy     SWE    Men                    Wg 96 KG

        Medal
0        Gold
1      Silver
2      Bronze
3        Gold
4      Silver
...       ...
31160  Bronze
31161    Gold
31162  Silver
31163  Bronze
31164  Bronze

[31165 rows x 9 columns]

___
**11. Write a program to select and print the "Participants", "Medal" and "Event" columns for index 10 and 201 from the DataFrame.?**

In [22]:
#Code here
print(fr2.loc[[10,201],['Participants','Medal','Event']])

          Participants   Medal           Event
10   PEPANOS, Antonios  Silver  400M Freestyle
201    LISTER, William    Gold      Water Polo

___
**12. Write a program to display the first 10 rows of the df DataFrame and check for any missing values in each column.?**

In [23]:
#Code here
print(fr2.head(10))
print(fr2.isna().sum())

   Year    City     Sport Discipline           Participants Country Gender  \
0  1896  Athens  Aquatics   Swimming          HAJOS, Alfred     HUN    Men
1  1896  Athens  Aquatics   Swimming       HERSCHMANN, Otto     AUT    Men
2  1896  Athens  Aquatics   Swimming      DRIVAS, Dimitrios     GRE    Men
3  1896  Athens  Aquatics   Swimming     MALOKINIS, Ioannis     GRE    Men
4  1896  Athens  Aquatics   Swimming     CHASAPIS, Spiridon     GRE    Men
5  1896  Athens  Aquatics   Swimming  CHOROPHAS, Efstathios     GRE    Men
6  1896  Athens  Aquatics   Swimming          HAJOS, Alfred     HUN    Men
7  1896  Athens  Aquatics   Swimming       ANDREOU, Joannis     GRE    Men
8  1896  Athens  Aquatics   Swimming  CHOROPHAS, Efstathios     GRE    Men
9  1896  Athens  Aquatics   Swimming          NEUMANN, Paul     AUT    Men

                        Event   Medal
0              100M Freestyle    Gold
1              100M Freestyle  Silver
2  100M Freestyle For Sailors  Bronze
3  100M Freestyle For Sailors    Gold
4  100M Freestyle For Sailors  Silver
5             1200M Freestyle  Bronze
6             1200M Freestyle    Gold
7             1200M Freestyle  Silver
8              400M Freestyle  Bronze
9              400M Freestyle    Gold
Year            0
City            0
Sport           0
Discipline      0
Participants    0
Country         4
Gender          0
Event           0
Medal           0
dtype: int64

___
**13. Write a program to select and print the "Country" and "Medal" columns from the df DataFrame, and then print the number of unique values in each of these columns.?**

In [24]:
#Code here
print(fr2[['Country','Medal']])
print(fr2.Country.nunique())
print(fr2.Medal.nunique())

      Country   Medal
0         HUN    Gold
1         AUT  Silver
2         GRE  Bronze
3         GRE    Gold
4         GRE  Silver
...       ...     ...
31160     POL  Bronze
31161     IRI    Gold
31162     RUS  Silver
31163     ARM  Bronze
31164     SWE  Bronze

[31165 rows x 2 columns]
147
3

___
**14. Write a program to group the df DataFrame by the "Country" column and calculate the total number of medals for each country. Print the result.?**

In [29]:
#Code here
medals=fr2.groupby("Country")['Medal'].count()
print(medals)

Country
AFG      2
AHO      1
ALG     15
ANZ     29
ARG    259
      ...
VIE      2
YUG    435
ZAM      2
ZIM     23
ZZX     48
Name: Medal, Length: 147, dtype: int64

___
**15. Write a program to sort the df DataFrame by the "Year" column in descending order and print the first 5 rows of the sorted DataFrame.?**

In [31]:
#Code here
fr3=fr2.sort_values(by="Year",ascending=False)
print(fr3.head(5))

       Year    City       Sport           Discipline        Participants  \
31164  2012  London   Wrestling  Wrestling Freestyle      LIDBERG, Jimmy
29885  2012  London      Boxing               Boxing     NEVIN, John Joe
29857  2012  London  Basketball           Basketball        BISHOP, Abby
29858  2012  London  Basketball           Basketball  CAMBAGE, Elizabeth
29859  2012  London  Basketball           Basketball    HARROWER, Kristi

      Country Gender       Event   Medal
31164     SWE    Men    Wg 96 KG  Bronze
29885     IRL    Men        56KG  Silver
29857     AUS  Women  Basketball  Bronze
29858     AUS  Women  Basketball  Bronze
29859     AUS  Women  Basketball  Bronze

___
**16. Write a program to add a new column "Century" to the df DataFrame. Classify each event as occurring in the "20th Century" if the "Year" is less than 2000, or the "21st Century" if the "Year" is 2000 or later. Print the first 5 rows to verify the change.**

In [37]:
#Code here
def century_check(dat):
    if(dat>=2000):
        return '21st Century'
    else:
        return '20th Century'
    
fr2['Century']=fr.Year.apply(century_check)

print(fr2.head(5))

   Year    City     Sport Discipline        Participants Country Gender  \
0  1896  Athens  Aquatics   Swimming       HAJOS, Alfred     HUN    Men
1  1896  Athens  Aquatics   Swimming    HERSCHMANN, Otto     AUT    Men
2  1896  Athens  Aquatics   Swimming   DRIVAS, Dimitrios     GRE    Men
3  1896  Athens  Aquatics   Swimming  MALOKINIS, Ioannis     GRE    Men
4  1896  Athens  Aquatics   Swimming  CHASAPIS, Spiridon     GRE    Men

                        Event   Medal       Century
0              100M Freestyle    Gold  20th Century
1              100M Freestyle  Silver  20th Century
2  100M Freestyle For Sailors  Bronze  20th Century
3  100M Freestyle For Sailors    Gold  20th Century
4  100M Freestyle For Sailors  Silver  20th Century

___
**17. Write a program to filter and print rows from the df DataFrame where the "Country" is "USA" and the "Medal" is "Gold". Also, count the number of rows that meet this condition.**

In [38]:
#Code here
mask1=fr2.Country=='USA'
mask2=fr2.Medal=='Gold'

mask3= mask1 & mask2

print(fr2.loc[mask3])

print(fr2.loc[mask3].count())

       Year    City       Sport           Discipline  \
13     1896  Athens   Athletics            Athletics
15     1896  Athens   Athletics            Athletics
21     1896  Athens   Athletics            Athletics
27     1896  Athens   Athletics            Athletics
29     1896  Athens   Athletics            Athletics
...     ...     ...         ...                  ...
30955  2012  London      Tennis               Tennis
30970  2012  London  Volleyball     Beach Volleyball
30971  2012  London  Volleyball     Beach Volleyball
31125  2012  London   Wrestling  Wrestling Freestyle
31133  2012  London   Wrestling  Wrestling Freestyle

                   Participants Country Gender             Event Medal  \
13                BURKE, Thomas     USA    Men              100M  Gold
15               CURTIS, Thomas     USA    Men      110M Hurdles  Gold
21                BURKE, Thomas     USA    Men              400M  Gold
27              GARRETT, Robert     USA    Men      Discus Throw  Gold
29                CLARK, Ellery     USA    Men         High Jump  Gold
...                         ...     ...    ...               ...   ...
30955          WILLIAMS, Serena     USA  Women           Singles  Gold
30970                MAY, Misty     USA  Women  Beach Volleyball  Gold
30971     WALSH JENNINGS, Kerri     USA  Women  Beach Volleyball  Gold
31125  BURROUGHS, Jordan Ernest     USA    Men          Wf 74 KG  Gold
31133     VARNER, Jacob Stephen     USA    Men          Wf 96 KG  Gold

            Century
13     20th Century
15     20th Century
21     20th Century
27     20th Century
29     20th Century
...             ...
30955  21st Century
30970  21st Century
30971  21st Century
31125  21st Century
31133  21st Century

[2235 rows x 10 columns]
Year            2235
City            2235
Sport           2235
Discipline      2235
Participants    2235
Country         2235
Gender          2235
Event           2235
Medal           2235
Century         2235
dtype: int64

___
**18. Write a program to create a new column "Medal Points" in the df DataFrame. Assign 3 points for "Gold", 2 points for "Silver", and 1 point for "Bronze". Print the first 5 rows to verify the changes.**

In [39]:
#Code here

def medl_pt(Medal):
    if (Medal=='Gold'):
        return 3
    elif (Medal=='Silver'):
        return 2
    else:
        return 1
    
fr2["Medal Points"]=fr2.Medal.apply(medl_pt)

print(fr2.head(5))

   Year    City     Sport Discipline        Participants Country Gender  \
0  1896  Athens  Aquatics   Swimming       HAJOS, Alfred     HUN    Men
1  1896  Athens  Aquatics   Swimming    HERSCHMANN, Otto     AUT    Men
2  1896  Athens  Aquatics   Swimming   DRIVAS, Dimitrios     GRE    Men
3  1896  Athens  Aquatics   Swimming  MALOKINIS, Ioannis     GRE    Men
4  1896  Athens  Aquatics   Swimming  CHASAPIS, Spiridon     GRE    Men

                        Event   Medal       Century  Medal Points
0              100M Freestyle    Gold  20th Century             3
1              100M Freestyle  Silver  20th Century             2
2  100M Freestyle For Sailors  Bronze  20th Century             1
3  100M Freestyle For Sailors    Gold  20th Century             3
4  100M Freestyle For Sailors  Silver  20th Century             2

___
**19. Write a program to filter the df DataFrame to include only rows where the "Country" is "USA". Then, group the filtered DataFrame by "Year" and calculate the total number of medals won by the USA each year. Print the results.**

In [46]:
#Code here

fr5=fr2[fr2['Country']=='USA']
fr6=medals=fr2.groupby("Country")['Medal'].count()
print(fr6)

Country
AFG      2
AHO      1
ALG     15
ANZ     29
ARG    259
      ...
VIE      2
YUG    435
ZAM      2
ZIM     23
ZZX     48
Name: Medal, Length: 147, dtype: int64

___
**20. Write a program to identify the athlete who has won the most medals. Display the athlete's name and the total number of medals they have won.**

In [57]:
#Code here

success= fr2.groupby('Participants')['Medal'].count().idxmax()

print(success)

medals= fr2.groupby('Participants')['Medal'].count().max()

print(medals)

print("Max medals: ", medals, ' Athlete:',success)

PHELPS, Michael
22
Max medals:  22  Athlete: PHELPS, Michael

___
**21. Write a program to group the df DataFrame by the "Sport" column and calculate the number of each type of medal (Gold, Silver, Bronze) for each sport. Print the results.**

In [58]:
#Code here
fr6=fr2.groupby('Sport')['Medal'].count()
print(fr6)

Sport
Aquatics             4170
Archery               329
Athletics            3638
Badminton             144
Baseball              335
Basketball           1012
Basque Pelota           4
Boxing                894
Canoe                  81
Canoe / Kayak        1002
Cricket                24
Croquet                 8
Cycling              1105
Equestrian            939
Fencing              1613
Football             1497
Golf                   30
Gymnastics           2307
Handball              973
Hockey               1422
Ice Hockey             27
Jeu de paume            3
Judo                  491
Lacrosse               59
Modern Pentathlon     180
Polo                   66
Rackets                10
Roque                   3
Rowing               2667
Rugby                 192
Sailing              1109
Shooting             1150
Skating                27
Softball              180
Table Tennis          144
Taekwondo             112
Tennis                296
Triathlon              24
Tug of War             94
Volleyball            994
Water Motorsports       5
Weightlifting         593
Wrestling            1212
Name: Medal, dtype: int64

### Good Luck!